a = int(input())
if a <= 10000:
    print(a)
else:
    print(a - (a / 100 * 13))

#Заплатите налоги
#Во всех странах присутствует подоходный налог. В каких-то странах он больше, в каких-то меньше. В РФ граждане платят подоходный налог в размере 13%.

#Представьте теперь, что люди с доходом меньше 20000 рублей освобождены от уплаты налога. Напишите программу, которая получает на вход значение дохода в виде целого числа и выводит на экран сумму, оставшуюся после уплаты налога в 13%. Если у человека зарплата меньше 20000р налог не удерживается.

#🚀Если не справляетесь, здесь подсказка🚀
#Sample Input 1:

#10000
#Sample Output 1:

#10000








