# Напишите программу, которая распечатает все натуральные числа от 1000 до 2000 включительно.

# Каждое число следует выводить на отдельной строчке как в примере ниже

# 1000
# 1001
# 1002
# ...
# 1998
# 1999
# 2000

x = 1000
while x < 2001:
    print(x)
    x = x + 1
