s = 0
n=int(input())
while n!=0:
        s=s+n
        n=int(input())
print(s)







#Пользователь вводит целые числа по одному в строке, последовательность оканчивается числом 0. Все, что вводится после 0 не относится к последовательности.
# Напишите программу, которая выводит сумму всех членов данной последовательности.



#🚀 Подсказка
#Число 0 является условием выхода из цикла. Нужно перестать считывать значения после того как ввели 0
#Sample Input 1:

#1
#2
#3
#0
#5
#6