a = int(input())
if a == 1:
    print('Январь')
elif a == 2:
    print('Февраль')
elif a == 3:
    print('Март')
elif a == 4:
    print('Апрель')
elif a == 5:
    print('Май')
elif a == 6:
    print('Июнь')
elif a == 7:
    print('Июль')
elif a == 8:
    print('Август')
elif a == 9:
    print('Сентябрь')
elif a == 10:
    print('Октябрь')
elif a == 11:
    print('Ноябрь')
else:
    if a == 12:
        print('Декабрь')


#Программа определяет наименование месяца по его номеру n. Название месяца пишется с заглавной буквы

#Программа получает на вход номер месяца - натуральное число N (N<=12) и в зависимости от его значения вывод название месяца

#Sample Input 1:

#4
#Sample Output 1:

#Апрель
#S#ample Input 2:

#9
#Sample Output 2:

#Сентябрь#









