x = int(input())
y = int(input())
z = int(input())

if x == y == z:
    print(3)
elif x == y != z:
    print(2)
elif x != y == z:
    print(2)
elif y != x == z:
    print(2)
else:
    print(0)

#Даны три целых числа, записанных в отдельных строках. Определите, сколько среди них совпадающих.

#Программа должна вывести одно из чисел: 3 (если все совпадают), 2 (если два совпадают) или 0 (если все числа различны).

#Разбор решения Youtube Patreon Boosty

#Sample Input 1:

#6
#6
#6
#Sample Output 1:

#3
#S#ample Input 2:

#7
#8
#7
#Sample Output 2:

#2#














